package com.party.presentation.screen.detail.detail_profile

fun cityNameToCountList(selectedCityName: String): List<String>{
    return when(selectedCityName){
        "서울" -> seoulList
        "경기" -> gyeonggiList
        "인천" -> incheonList
        "강원" -> gangwonList
        "충북" -> chungbukList
        "충남" -> chungnamList
        "세종" -> sejongList
        "대전" -> daejeonList
        "대구" -> daeguList
        "광주" -> gwangjuList
        "전북" -> jeonbukList
        "전남" -> jeonnamList
        "경북" -> gyeongbukList
        "경남" -> gyeongnamList
        "울산" -> ulsanList
        "부산" -> busanList
        "제주" -> jejuList
        else -> emptyList()
    }
}


enum class LocationTest(
    val city: String,
){
    SEOUL("서울"),
    GYEONGGI("경기"),
    INCHEON("인천"),
    GANGWON("강원"),
    CHUNGBUK("충북"),
    CHUNGNAM("충남"),
    SEJONG("세종"),
    DAEGU("대구"),
    DAEJEON("대전"),
    GWANGJU("광주"),
    JEONBUK("전북"),
    JEONNAM("전남"),
    GYEONGBUK("경북"),
    GYEONGNAM("경남"),
    ULSAN("울산"),
    BUSAN("부산"),
    JEJU("제주");
}

val seoulList = listOf(
    "전체",
    "강남구",
    "강동구",
    "강북구",
    "강서구",
    "관악구",
    "광진구",
    "구로구",
    "금천구",
    "노원구",
    "도봉구",
    "동대문구",
    "동작구",
    "마포구",
    "서대문구",
    "서초구",
    "성동구",
    "성북구",
    "송파구",
    "양천구",
    "영등포구",
    "용산구",
    "은평구",
    "종로구",
    "중구",
    "중랑구",
)

val gyeonggiList= listOf(
    "전체",
    "수원시",
    "성남시",
    "고양시",
    "용인시",
    "부천시",
    "안산시",
    "안양시",
    "남양주시",
    "화성시",
    "의정부시",
    "시흥시",
    "평택시",
    "광명시",
    "파주시",
    "군포시",
    "광주시",
    "김포시",
    "이천시",
    "양주시",
    "구리시",
    "오산시",
    "안성시",
    "의왕시",
    "하남시",
    "포천시",
    "동두천시",
    "과천시",
    "여주시",
    "양평군",
    "가평군",
    "연천군",
)

val incheonList = listOf(
    "전체",
    "중구",
    "동구",
    "미추홀구",
    "연수구",
    "남동구",
    "부평구",
    "계양구",
    "서구",
    "강화군",
    "옹진군",
)

val gangwonList = listOf(
    "전체",
    "춘천시",
    "인제군",
    "양구군",
    "고성군",
    "양양군",
    "강릉시",
    "속초시",
    "삼척시",
    "정선군",
    "평창군",
    "영월군",
    "원주시",
    "횡성군",
    "홍천군",
    "화천군",
    "철원군",
    "태백시",
    "동해시",
)

val chungbukList = listOf(
    "전체",
    "청주시",
    "충주시",
    "제천시",
    "보은군",
    "옥천군",
    "영동군",
    "증평군",
    "진천군",
    "괴산군",
    "음성군",
    "단양군",
)

val chungnamList = listOf(
    "전체",
    "천안시",
    "공주시",
    "보령시",
    "아산시",
    "서산시",
    "논산시",
    "계룡시",
    "당진시",
    "금산군",
    "부여군",
    "서천군",
    "청양군",
    "홍성군",
    "예산군",
    "태안군",
)

val sejongList = listOf(
    "전체",
    "조치원읍",
    "연기면",
    "연동면",
    "부강면",
    "금남면",
    "장군면",
    "연서면",
    "전의면",
    "전동면",
    "소정면",
    "한솔동",
    "새롬동",
    "도담동",
    "아름동",
    "종촌동",
    "고운동",
    "소담동",
    "보람동",
    "대평동",
    "다정동",
    "해밀동",
    "반곡동",
)

val daeguList = listOf(
    "전체",
    "달성군",
    "달서구",
    "수성구",
    "북구",
    "남구",
    "서구",
    "동구",
    "중구",
)

val daejeonList = listOf(
    "전체",
    "대덕구",
    "유성구",
    "서구",
    "중구",
    "동구",
)

val gwangjuList = listOf(
    "전체",
    "광산구",
    "남구",
    "동구",
    "북구",
    "서구",
)

val jeonbukList = listOf(
    "전체",
    "전주시",
    "군산시",
    "익산시",
    "정읍시",
    "남원시",
    "김제시",
    "완주군",
    "진안군",
    "무주군",
    "장수군",
    "임실군",
    "순창군",
    "고창군",
    "부안군",
)

val jeonnamList = listOf(
    "전체",
    "목포시",
    "여수시",
    "순천시",
    "나주시",
    "광양시",
    "담양군",
    "곡성군",
    "구례군",
    "고흥군",
    "보성군",
    "화순군",
    "장흥군",
    "강진군",
    "해남군",
    "영암군",
    "무안군",
    "함평군",
    "영광군",
    "장성군",
    "완도군",
    "진도군",
    "신안군",
)

val gyeongbukList = listOf(
    "전체",
    "포항시",
    "경주시",
    "김천시",
    "안동시",
    "구미시",
    "영주시",
    "영천시",
    "상주시",
    "문경시",
    "경산시",
    "군위군",
    "의성군",
    "청송군",
    "영양군",
    "영덕군",
    "청도군",
    "고령군",
    "성주군",
    "칠곡군",
    "예천군",
    "봉화군",
    "울진군",
    "울릉군",
)

val gyeongnamList = listOf(
    "전체",
    "창원시",
    "김해시",
    "양산시",
    "진주시",
    "거제시",
    "통영시",
    "사천시",
    "밀양시",
    "함안군",
    "거창군",
    "창녕군",
    "고성군",
    "하동군",
    "합천군",
    "남해군",
    "함양군",
    "산청군",
    "의령군",
)

val ulsanList = listOf(
    "전체",
    "중구",
    "남구",
    "동구",
    "북구",
    "울주군",
)

val busanList = listOf(
    "전체",
    "중구",
    "서구",
    "동구",
    "영도구",
    "부산진구",
    "동래구",
    "남구",
    "북구",
    "강서구",
    "해운대구",
    "사하구",
    "금정구",
    "연제구",
    "수영구",
    "사상구",
    "기장군",
)

val jejuList = listOf(
    "전체",
    "제주시",
    "한림읍",
    "애월읍",
    "구좌읍",
    "조천읍",
    "한경면",
    "추자면",
    "우도면",
    "서귀포",
    "대정읍",
    "남원읍",
    "성산읍",
    "안덕면",
    "표선면",
)